---
kind: type
id: T:Autodesk.Revit.DB.AreaElemType
source: html/32fba1d0-a415-1acc-31be-b62afa4bfe53.htm
---
# Autodesk.Revit.DB.AreaElemType

An enumerated type to store type of AreaElement.

## Syntax (C#)
```csharp
public enum AreaElemType
```